nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_mcg.h
/*******************************************************************************
 * HW_MCG_LFTRIM - MCG Low-frequency IRC8M Trim Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_LFTRIM - MCG Low-frequency IRC8M Trim Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_lftrim
{
    uint8_t U;
    struct _hw_mcg_lftrim_bitfields
    {
        uint8_t LIRC_FTRIM : 7;        /*!< [6:0] LIRC8M TRIM */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_mcg_lftrim_t;

/*!
 * @name Constants and macros for entire MCG_LFTRIM register
 */
/*@{*/
#define HW_MCG_LFTRIM_ADDR(x)    ((x) + 0x1AU)

#define HW_MCG_LFTRIM(x)         (*(__I hw_mcg_lftrim_t *) HW_MCG_LFTRIM_ADDR(x))
#define HW_MCG_LFTRIM_RD(x)      (HW_MCG_LFTRIM(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_LFTRIM bitfields
 */

/*!
 * @name Register MCG_LFTRIM, field LIRC_FTRIM[6:0] (RO)
 *
 * Loads from a factory programmed location when out of reset.
 */
/*@{*/
#define BP_MCG_LFTRIM_LIRC_FTRIM (0U)      /*!< Bit position for MCG_LFTRIM_LIRC_FTRIM. */
#define BM_MCG_LFTRIM_LIRC_FTRIM (0x7FU)   /*!< Bit mask for MCG_LFTRIM_LIRC_FTRIM. */
#define BS_MCG_LFTRIM_LIRC_FTRIM (7U)      /*!< Bit field size in bits for MCG_LFTRIM_LIRC_FTRIM. */

/*! @brief Read current value of the MCG_LFTRIM_LIRC_FTRIM field. */
#define BR_MCG_LFTRIM_LIRC_FTRIM(x) (BME_UBFX8(HW_MCG_LFTRIM_ADDR(x), BP_MCG_LFTRIM_LIRC_FTRIM, BS_MCG_LFTRIM_LIRC_FTRIM))
/*@}*/

/*******************************************************************************
 * HW_MCG_LSTRIM - MCG Low-frequency IRC2M Trim Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_LSTRIM - MCG Low-frequency IRC2M Trim Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_lstrim
{
    uint8_t U;
    struct _hw_mcg_lstrim_bitfields
    {
        uint8_t LIRC_STRIM : 7;        /*!< [6:0] LIRC2M TRIM */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_mcg_lstrim_t;

/*!
 * @name Constants and macros for entire MCG_LSTRIM register
 */
/*@{*/
#define HW_MCG_LSTRIM_ADDR(x)    ((x) + 0x1BU)

#define HW_MCG_LSTRIM(x)         (*(__I hw_mcg_lstrim_t *) HW_MCG_LSTRIM_ADDR(x))
#define HW_MCG_LSTRIM_RD(x)      (HW_MCG_LSTRIM(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_LSTRIM bitfields
 */

/*!
 * @name Register MCG_LSTRIM, field LIRC_STRIM[6:0] (RO)
 *
 * Loads from a factory programmed location when out of reset.
 */
/*@{*/
#define BP_MCG_LSTRIM_LIRC_STRIM (0U)      /*!< Bit position for MCG_LSTRIM_LIRC_STRIM. */
#define BM_MCG_LSTRIM_LIRC_STRIM (0x7FU)   /*!< Bit mask for MCG_LSTRIM_LIRC_STRIM. */
#define BS_MCG_LSTRIM_LIRC_STRIM (7U)      /*!< Bit field size in bits for MCG_LSTRIM_LIRC_STRIM. */

/*! @brief Read current value of the MCG_LSTRIM_LIRC_STRIM field. */
#define BR_MCG_LSTRIM_LIRC_STRIM(x) (BME_UBFX8(HW_MCG_LSTRIM_ADDR(x), BP_MCG_LSTRIM_LIRC_STRIM, BS_MCG_LSTRIM_LIRC_STRIM))
/*@}*/

/*******************************************************************************
 * hw_mcg_t - module struct
 ******************************************************************************/
/*!
 * @brief All MCG module registers.
 */
#pragma pack(1)
typedef struct _hw_mcg
{
    __IO hw_mcg_c1_t C1;                   /*!< [0x0] MCG Control Register 1 */
    __IO hw_mcg_c2_t C2;                   /*!< [0x1] MCG Control Register 2 */
    uint8_t _reserved0[4];
    __I hw_mcg_s_t S;                      /*!< [0x6] MCG Status Register */
    uint8_t _reserved1[1];
    __IO hw_mcg_sc_t SC;                   /*!< [0x8] MCG Status and Control Register */
    uint8_t _reserved2[11];
    __I hw_mcg_hctrim_t HCTRIM;            /*!< [0x14] MCG High-frequency IRC Coarse Trim Register */
    __I hw_mcg_httrim_t HTTRIM;            /*!< [0x15] MCG High-frequency IRC Tempco (Temperature Coefficient) Trim Register */
    __I hw_mcg_hftrim_t HFTRIM;            /*!< [0x16] MCG High-frequency IRC Fine Trim Register */
    uint8_t _reserved3[1];
    __IO hw_mcg_mc_t MC;                   /*!< [0x18] MCG Miscellaneous Control Register */
    __I hw_mcg_ltrimrng_t LTRIMRNG;        /*!< [0x19] MCG Low-frequency IRC Trim Range Register */
    __I hw_mcg_lftrim_t LFTRIM;            /*!< [0x1A] MCG Low-frequency IRC8M Trim Register */
    __I hw_mcg_lstrim_t LSTRIM;            /*!< [0x1B] MCG Low-frequency IRC2M Trim Register */
} hw_mcg_t;
#pragma pack()

/*! @brief Macro to access all MCG registers. */
/*! @param x MCG module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_MCG(MCG_BASE)</code>. */
#define HW_MCG(x)      (*(hw_mcg_t *)(x))

#endif /* __HW_MCG_REGISTERS_H__ */
/* EOF */
